use [01 Астапкина ПРОДАЖИ]
SELECT ТОВАРЫ.Наименование, ЗАКАЗЫ.Наименование_товара, ЗАКАЗЫ.Дата_поставки
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.Наименование_фирмы = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.Наименование_товара = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.Дата_поставки > CONVERT(DATETIME, '2021-06-20 00:00:00', 102))

SELECT Наименование, Цена
FROM     ТОВАРЫ
WHERE  (Цена > 2500 AND Цена < 3500)

SELECT Наименование_товара, Заказчик, Количество
FROM     ЗАКАЗЫ
WHERE  (Наименование_товара = N'Asus ZenBook')

SELECT Наименование_товара, Дата_поставки, Заказчик
FROM     ЗАКАЗЫ
WHERE  (Заказчик = N'21vek')
ORDER BY Дата_поставки

